



Network Working Group                                       M. Boucadair
Internet-Draft                                                    Orange
Intended status: Standards Track                                T. Reddy
Expires: April 19, 2018                                           McAfee
                                                        October 16, 2017


Multi-homing Deployment Considerations for Distributed-Denial-of-Service
                      Open Threat Signaling (DOTS)
                  draft-boucadair-dots-multihoming-02

Abstract

   This document discusses multi-homing considerations for Distributed-
   Denial-of-Service Open Threat Signaling (DOTS).  The goal is to
   provide a set of guidance for DOTS clients/gateways when multihomed.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in RFC
   2119 [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 19, 2018.

Copyright Notice

   Copyright (c) 2017 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Boucadair & Reddy        Expires April 19, 2018                 [Page 1]

Internet-Draft              DOTS Multihoming                October 2017


   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4
   3.  Multi-Homing Scenarios  . . . . . . . . . . . . . . . . . . .   4
     3.1.  Residential CPE . . . . . . . . . . . . . . . . . . . . .   4
     3.2.  Multi-homed Enterprise: Single CPE, Multiple Upstream
           ISPs  . . . . . . . . . . . . . . . . . . . . . . . . . .   5
     3.3.  Multi-homed Enterprise: Multiple CPEs, Multiple Upstream
           ISPs  . . . . . . . . . . . . . . . . . . . . . . . . . .   6
     3.4.  Multi-homed Enterprise with the Same ISP  . . . . . . . .   7
   4.  DOTS Deployment Considerations  . . . . . . . . . . . . . . .   7
     4.1.  Residential CPE . . . . . . . . . . . . . . . . . . . . .   7
     4.2.  Multi-homed Enterprise: Single CPE, Multiple Upstream
           ISPs  . . . . . . . . . . . . . . . . . . . . . . . . . .   8
     4.3.  Multi-homed Enterprise: Multiple CPEs, Multiple Upstream
           ISPs  . . . . . . . . . . . . . . . . . . . . . . . . . .  10
     4.4.  Multi-homed Enterprise: Single ISP  . . . . . . . . . . .  11
   5.  Security Considerations . . . . . . . . . . . . . . . . . . .  12
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  12
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  12
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  12
     8.1.  Normative References  . . . . . . . . . . . . . . . . . .  12
     8.2.  Informative References  . . . . . . . . . . . . . . . . .  13
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  14

1.  Introduction

   In many deployments, it may not be possible for a network to
   determine the cause for a distributed Denial-of-Service (DoS) attack
   [RFC4732], but instead just realize that some resources seem to be
   under attack.  To fill that gap, the IETF is specifying an
   architecture, called DDoS Open Threat Signaling (DOTS)
   [I-D.ietf-dots-architecture], in which a DOTS client can inform a
   DOTS server that the network is under a potential attack and that
   appropriate mitigation actions are required.  Indeed, because the
   lack of a common method to coordinate a real-time response among
   involved actors and network domains inhibits the effectiveness of
   DDoS attack mitigation, DOTS protocol is meant to carry requests for
   DDoS attack mitigation, thereby reducing the impact of an attack and



Boucadair & Reddy        Expires April 19, 2018                 [Page 2]

Internet-Draft              DOTS Multihoming                October 2017


   leading to more efficient defensive actions.
   [I-D.ietf-dots-use-cases] identifies a set of scenarios for DOTS;
   almost all these scenarios involve a CPE.

   The basic high-level DOTS architecture is illustrated in Figure 1
   ([I-D.ietf-dots-architecture]):

          +-----------+            +-------------+
          | Mitigator | ~~~~~~~~~~ | DOTS Server |
          +-----------+            +-------------+
                                          |
                                          |
                                          |
          +---------------+        +-------------+
          | Attack Target | ~~~~~~ | DOTS Client |
          +---------------+        +-------------+

                     Figure 1: Basic DOTS Architecture

   [I-D.ietf-dots-architecture] specifies that the DOTS client may be
   provided with a list of DOTS servers; each associated with one or
   more IP addresses.  These addresses may or may not be of the same
   address family.  The DOTS client establishes one or more DOTS
   signaling sessions by connecting to the provided DOTS server(s)
   addresses.

   DOTS may be deployed within networks that are connected to one single
   upstream provider.  It can also be enabled within networks that are
   multi-homed.  The reader may refer to [RFC3582] for an overview of
   multi-homing goals and motivations.  This document discusses DOTS
   multi-homing considerations.  Specifically, the document aims to:

   1.  Complete the base DOTS architecture with multi-homing specifics.
       Those specifics need to be taking into account because:

       *  Send a DOTS mitigation request to an arbitrary DOTS server
          won't help mitigating a DDoS attack.

       *  Blindly forking all DOTS mitigation requests among all
          available DOTS servers is suboptimal.

       *  Sequentially contacting DOTS servers may increase the delay
          before a mitigation plan is enforced.

   2.  Identify DOTS deployment schemes in a multi-homing context, where
       DOTS service can be offered by all or a subset of upstream
       providers.




Boucadair & Reddy        Expires April 19, 2018                 [Page 3]

Internet-Draft              DOTS Multihoming                October 2017


   3.  Sketch guidelines and recommendations for placing DOTS requests
       in multi-homed networks, e.g.,:

       *  Select the appropriate DOTS server(s).

       *  Identify cases where anycast is not recommended.

   To that aim, this document adopts the following methodology:

   o  Identify and extract viable deployment candidates from
      [I-D.ietf-dots-use-cases].

   o  Augment the description with multi-homing technicalities, e.g.,

      *  One vs. multiple upstream network providers

      *  One vs. multiple interconnect routers

      *  Provider-Independent (PI) vs. Provider-Aggregatable (PA)

   o  Describe the recommended behavior of DOTS clients and gateways for
      each case.

   Multi-homed DOTS agents are assumed to make use of the protocols
   defined in [I-D.ietf-dots-signal-channel] and
   [I-D.ietf-dots-data-channel]; no specific extension is required to
   the base DOTS protocols for deploying DOTS in a multihomed context.

2.  Terminology

   This document makes use of the terms defined in
   [I-D.ietf-dots-architecture] and [RFC4116].

   IP refers to both IPv4 and IPv6.

3.  Multi-Homing Scenarios

   This section briefly describes some multi-homing scenarios that are
   relevant to DOTS.  In the following sub-sections, only the
   connections of border routers are shown; internal network topologies
   are not elaborated hereafter.

3.1.  Residential CPE

   The scenario shown in Figure 2 is characterized as follows:

   o  The home network is connected to the Internet using one single CPE
      (Customer Premises Equipment).



Boucadair & Reddy        Expires April 19, 2018                 [Page 4]

Internet-Draft              DOTS Multihoming                October 2017


   o  The CPE is connected to multiple provisioning domains (i.e.  both
      fixed and mobile networks).  Provisioning domain (PvD) is
      explained in [RFC7556].

   o  Each of these provisioning domains assign IP addresses/prefixes to
      the CPE.  These addresses/prefixes are said to be Provider-
      Aggregatable (PA).

   o  The CPE is provided by each of these provisioning domains with
      additional configuration information such as a list of DNS
      servers, DNS suffixes associated with the network, default gateway
      address, and DOTS server's name
      [I-D.boucadair-dots-server-discovery].

   o  Because of ingress filtering, packets forwarded by the CPE to a
      given provisioning domain must be send with a source IP address
      that was assigned by that network [RFC8043].

                  +-------+            +-------+
                  |Fixed  |            |Mobile |
                  |Network|            |Network|
                  +---+---+            +---+---+
                      |                    |     Service Providers
          ............|....................|.......................
                      +---------++---------+     Home Network
                                ||
                             +--++-+
                             | CPE |
                             +-----+
                                   ... (Internal Network)


               Figure 2: Typical Multi-homed Residential CPE

3.2.  Multi-homed Enterprise: Single CPE, Multiple Upstream ISPs

   The scenario shown in Figure 3 is characterized as follows:

   o  The enterprise network is connected to the Internet using one
      single router.

   o  That router is connected to multiple provisioning domains (i.e.
      managed by distinct administrative entities).

   Unlike the previous scenario, two sub-cases can be considered for an
   enterprise network with regards to assigned addresses:





Boucadair & Reddy        Expires April 19, 2018                 [Page 5]

Internet-Draft              DOTS Multihoming                October 2017


   1.  Provider Independent (PI) addresses: The enterprise is the owner
       of the IP addresses/prefixes; the same address/prefix is then
       used for communication placed using any of the provisioning
       domains.

   2.  PA addresses/prefixes: each of provisioning domains assigns IP
       addresses/prefixes to the enterprise network.

                  +------+              +------+
                  | ISP1 |              | ISP2 |
                  +---+--+              +--+---+
                      |                    |     Service Providers
          ............|....................|.......................
                      +---------++---------+     Enterprise Network
                                ||
                             +--++-+
                             | rtr |
                             +-----+
                                   ... (Internal Network)


     Figure 3: Multi-homed Enterprise Network (Single CPE connected to
                            Multiple Networks)

3.3.  Multi-homed Enterprise: Multiple CPEs, Multiple Upstream ISPs

   This scenario is similar to the one in Section 3.2; the main
   difference is that dedicated routers are used to connect to each
   provisioning domain.

                            +------+    +------+
                            | ISP1 |    | ISP2 |
                            +---+--+    +--+---+
                                |          |     Service Providers
          ......................|..........|.......................
                                |          |     Enterprise Network
                            +---+--+    +--+---+
                            | rtr1 |    | rtr2 |
                            +------+    +------+

                                  ... (Internal Network)


     Figure 4: Multi-homed Enterprise Network (Multiple CPEs, Multiple
                                   ISPs)






Boucadair & Reddy        Expires April 19, 2018                 [Page 6]

Internet-Draft              DOTS Multihoming                October 2017


3.4.  Multi-homed Enterprise with the Same ISP

   This scenario is a variant of Section 3.2 and Section 3.3 in which
   multi-homing is provided by the same ISP (i.e., same provisioning
   domain).

4.  DOTS Deployment Considerations

   Table 1 provides some sample (non-exhaustive) deployment schemes to
   illustrate how DOTS agents may be deployed for each of the scenarios
   introduced in Section 3.

   +---------------------------+-------------------------+-------------+
   |          Scenario         |       DOTS client       |     DOTS    |
   |                           |                         |   gateway   |
   +---------------------------+-------------------------+-------------+
   |      Residential CPE      |           CPE           |     N/A     |
   +---------------------------+-------------------------+-------------+
   |    Single CPE, Multiple   |  internal hosts or CPE  |     CPE     |
   |    provisioning domains   |                         |             |
   +---------------------------+-------------------------+-------------+
   |  Multiple CPEs, Multiple  |  internal hosts or all  |  CPEs (rtr1 |
   |    provisioning domains   |   CPEs (rtr1 and rtr2)  |  and rtr2)  |
   +---------------------------+-------------------------+-------------+
   |  Multi-homed enterprise,  |  internal hosts or all  |  CPEs (rtr1 |
   |    Single provisioning    |   CPEs (rtr1 and rtr2)  |  and rtr2)  |
   |           domain          |                         |             |
   +---------------------------+-------------------------+-------------+

                     Table 1: Sample Deployment Cases

   These deployment schemes are further discussed in the following sub-
   sections.

4.1.  Residential CPE

   Figure 5 depicts DOTS signaling sessions that are required to be
   established between a DOTS client (C) and DOTS servers (S1, S2) in
   the context of the scenario described in Section 3.1.

   The DOTS client MUST resolve the DOTS server's name provided by a
   provisioning domain ([I-D.boucadair-dots-server-discovery]) using the
   DNS servers learned from the same provisioning domain.  The DOTS
   client MUST use the source address selection algorithm defined in
   [RFC6724] to select the candidate source addresses to contact each of
   these DOTS servers.  DOTS signaling sessions must be established and
   maintained with each of the DOTS servers because the mitigation scope
   of these servers is restricted.  The DOTS client SHOULD use the



Boucadair & Reddy        Expires April 19, 2018                 [Page 7]

Internet-Draft              DOTS Multihoming                October 2017


   certificate provisioned by a provisioning domain to authenticate
   itself to the DOTS server provided by the same provisioning domain.
   When conveying a mitigation request to protect the attack target(s),
   the DOTS client among the DOTS servers available MUST select a DOTS
   server whose network has assigned the prefixes from which target
   prefixes and target IP addresses are derived.  For example,
   mitigation request to protect target resources bound to a PA IP
   address/prefix cannot be honored by an provisioning domain other than
   the one that owns those addresses/prefixes.  Consequently, Typically,
   if a CPE detects a DDoS attack on all its network attachments, it
   must contact both DOTS servers for mitigation.  Nevertheless, if the
   DDoS attack is received from one single network, then only the DOTS
   server of that network must be contacted.

   The DOTS client MUST be able to associate a DOTS server with each
   provisioning domain.  For example, if the DOTS client is provisioned
   with S1 using DHCP when attaching to a first network and with S2
   using Protocol Configuration Option (PCO) when attaching to a second
   network, the DOTS client must record the interface from which a DOTS
   server was provisioned.  DOTS signaling session to a given DOTS
   server must be established using the interface from which the DOTS
   server was provisioned.

                                                +--+
                                     -----------|S1|
                                    /           +--+
                                   /
                                  /
                            +---+/
                            | C |
                            +---+\
                                  \
                                   \
                                    \           +--+
                                     -----------|S2|
                                                +--+

       Figure 5: DOTS associations for a multihomed residential CPE

4.2.  Multi-homed Enterprise: Single CPE, Multiple Upstream ISPs

   Figure 6 illustrates a first set of DOTS associations that can be
   established with a DOTS gateway is enabled in the context of the
   scenario described in Section 3.2.  This deployment is characterized
   as follows:

   o  One of more DOTS clients are enabled in hosts located in the
      internal network.



Boucadair & Reddy        Expires April 19, 2018                 [Page 8]

Internet-Draft              DOTS Multihoming                October 2017


   o  A DOTS getaway is enabled to aggregate/relay the requests to
      upstream DOTS servers.

   When PA addresses/prefixes are in used, the same considerations
   discussed in Section 4.1 are to be followed by the DOTS gateway to
   contact its DOTS server(s).  The DOTS gateways can be reachable from
   DOTS client using a unicast or anycast address.

   Nevertheless, when PI addresses/prefixes are assigned, the DOTS
   gateway MUST sent the same request to all its DOTS servers.

                                                   +--+
                                        -----------|S1|
                        +---+          /           +--+
                        | C1|----+    /
                        +---+    |   /
                    +---+      +-+-+/
                    | C3|------| G |
                    +---+      +-+-+\
                        +---+    |   \
                        | C2|----+    \
                        +---+          \           +--+
                                        -----------|S2|
                                                   +--+

    Figure 6: Multiple DOTS Clients, Single DOTS Gateway, Multiple DOTS
                                  Servers

   An alternate deployment model is depicted in Figure 7.  This
   deployment assumes that:

   o  One of more DOTS clients are enabled in hosts located in the
      internal network.  These DOTS client may use
      [I-D.boucadair-dots-server-discovery] to discover its DOTS
      server(s).

   o  These DOTS clients communicate directly with upstream DOTS
      servers.

   If PI addresses/prefixes are in use, the DOTS client can send the
   mitigation request for all its PI addresses/prefixes to any one of
   the DOTS servers.  The use of anycast addresses is NOT RECOMMENDED.

   If PA addresses/prefxies are used, the same considerations discussed
   in Section 4.1 are to be followed by the DOTS clients.  Because DOTS
   clients are not located on the CPE and multiple addreses/prefixes may
   not be assigned to the DOTS client (IPv4 context, typically), some
   complications arise to steer the traffic to the appropriate DOTS



Boucadair & Reddy        Expires April 19, 2018                 [Page 9]

Internet-Draft              DOTS Multihoming                October 2017


   server using the appropriate source IP address.  These complications
   discussed in [RFC4116] are not specific to DOTS .

                                   +--+
                          +--------|C1|--------+
                          |        +--+        |
                         +--+      +--+      +--+
                         |S2|------|C3|------|S1|
                         +--+      +--+      +--+
                          |        +--+        |
                          +--------|C2|--------+
                                   +--+

          Figure 7: Multiple DOTS Clients, Multiple DOTS Servers

   Another deployment approach is to enable many DOTS clients; each of
   them responsible to handle communication with a specific DOTS server
   (see Figure 8).  Each DOTS client is provided with policies (e.g.,
   prefix filter) that will trigger DOTS communications with the DOTS
   servers.  The CPE MUST select the appropriate source IP address when
   forwarding DOTS messages received from an internal DOTS client.  If
   anycast addresses are used to reach DOTS servers, the CPE may not be
   able to select the appropriate provisioning domain to which the
   mitigation request should be forwarded.  As a consequence, the
   request may not be forwarded to the appropriate DOTS server.

                                   +--+
                          +--------|C1|
                          |        +--+
                         +--+      +--+      +--+
                         |S2|      |C2|------|S1|
                         +--+      +--+      +--+


                    Figure 8: Single Homed DOTS Clients

4.3.  Multi-homed Enterprise: Multiple CPEs, Multiple Upstream ISPs

   The deployments depicted in Figure 7 and Figure 8 apply also for the
   scenario described in Section 3.3.  One specific problem for this
   scenario is to select the appropriate exit router when contacting a
   given DOTS server.

   An alternative deployment scheme is shown in Figure 9:

   o  DOTS clients are enabled in hosts located in the internal network.

   o  A DOTS gateway is enabled in each CPE (rtr1, rtr2).



Boucadair & Reddy        Expires April 19, 2018                [Page 10]

Internet-Draft              DOTS Multihoming                October 2017


   o  Each of these DOTS gateways communicate with the DOTS server of
      the provisioning domain.

   When PI addresses/prefixes are used, DOTS clients can contact any of
   the DOTS gateways to send a DOTS message.  DOTS gateway will then
   relay the request to the DOTS server.  Note that the use of anycast
   addresses is NOT RECOMMENDED to establish DOTS signaling sessions
   between DOTS client and DOTS gateways.

   When PA addresses/prefixes are used, but no filter rules are provided
   to DOTS clients, these later MUST contact all DOTS gateways
   simultaneously to send a DOTS message.  Upon receipt of a request by
   a DOTS gateway, it MUST check whether the request is to be forwarded
   upstream or be rejected.

   When PA addresses/prefixes are used, but specific filter rules are
   provided to DOTS clients using some means that are out of scope,
   these later MUST select the appropriate DOTS gateway to be contacted.
   The use of anycast is NOT RECOMMENDED to reach DOTS gateways.

                                       +---+
                          +------------| C1|----+
                          |            +---+    |
              +--+      +-+-+      +---+      +-+-+      +--+
              |S2|------|G2 |------| C3|------|G1 |------|S1|
              +--+      +-+-+      +---+      +-+-+      +--+
                          |            +---+    |
                          +------------| C2|----+
                                       +---+

     Figure 9: Multiple DOTS Clients, Multiple DOTS Gateways, Multiple
                               DOTS Servers

4.4.  Multi-homed Enterprise: Single ISP

   The key difference of the scenario described in Section 3.4 compared
   to the other scenarios is that multi-homing is provided by the same
   ISP.  Concretely, that ISP can decided to provision the enterprise
   network with:

   1.  The same DOTS server for all network attachments.

   2.  Distinct DOTS servers for each network attachment.  These DOTS
       servers needs to coordinate when a mitigation action is received
       from the enterprise network.






Boucadair & Reddy        Expires April 19, 2018                [Page 11]

Internet-Draft              DOTS Multihoming                October 2017


   In both cases, DOTS agents enabled within the enterprise network may
   decide to select one or all network attachments to place DOTS
   mitigation requests.

5.  Security Considerations

   DOTS-related security considerations are discussed in Section 4 of
   [I-D.ietf-dots-architecture].

   TBD: In Home networks, if EST is used then how will the DOTS gateway
   (EST client) be provisioned with credentials for initial enrolment
   (see Section 2.2 in RFC 7030).

6.  IANA Considerations

   This document does not require any action from IANA.

7.  Acknowledgements

   Thanks to Roland Dobbins and Nik Teague for sharing their comments on
   the mailing list.

   Thanks to Kirill Kasavchenko for the comments.

8.  References

8.1.  Normative References

   [I-D.ietf-dots-architecture]
              Mortensen, A., Andreasen, F., Reddy, T.,
              christopher_gray3@cable.comcast.com, c., Compton, R., and
              N. Teague, "Distributed-Denial-of-Service Open Threat
              Signaling (DOTS) Architecture", draft-ietf-dots-
              architecture-04 (work in progress), July 2017.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC6724]  Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown,
              "Default Address Selection for Internet Protocol Version 6
              (IPv6)", RFC 6724, DOI 10.17487/RFC6724, September 2012,
              <https://www.rfc-editor.org/info/rfc6724>.







Boucadair & Reddy        Expires April 19, 2018                [Page 12]

Internet-Draft              DOTS Multihoming                October 2017


8.2.  Informative References

   [I-D.boucadair-dots-server-discovery]
              Boucadair, M., Reddy, T., and P. Patil, "Distributed-
              Denial-of-Service Open Threat Signaling (DOTS) Server
              Discovery", draft-boucadair-dots-server-discovery-02 (work
              in progress), July 2017.

   [I-D.ietf-dots-data-channel]
              Reddy, T., Boucadair, M., Nishizuka, K., Xia, L., Patil,
              P., Mortensen, A., and N. Teague, "Distributed Denial-of-
              Service Open Threat Signaling (DOTS) Data Channel", draft-
              ietf-dots-data-channel-05 (work in progress), October
              2017.

   [I-D.ietf-dots-signal-channel]
              Reddy, T., Boucadair, M., Patil, P., Mortensen, A., and N.
              Teague, "Distributed Denial-of-Service Open Threat
              Signaling (DOTS) Signal Channel", draft-ietf-dots-signal-
              channel-05 (work in progress), October 2017.

   [I-D.ietf-dots-use-cases]
              Dobbins, R., Migault, D., Fouant, S., Moskowitz, R.,
              Teague, N., Xia, L., and K. Nishizuka, "Use cases for DDoS
              Open Threat Signaling", draft-ietf-dots-use-cases-07 (work
              in progress), July 2017.

   [RFC3582]  Abley, J., Black, B., and V. Gill, "Goals for IPv6 Site-
              Multihoming Architectures", RFC 3582,
              DOI 10.17487/RFC3582, August 2003,
              <https://www.rfc-editor.org/info/rfc3582>.

   [RFC4116]  Abley, J., Lindqvist, K., Davies, E., Black, B., and V.
              Gill, "IPv4 Multihoming Practices and Limitations",
              RFC 4116, DOI 10.17487/RFC4116, July 2005,
              <https://www.rfc-editor.org/info/rfc4116>.

   [RFC4732]  Handley, M., Ed., Rescorla, E., Ed., and IAB, "Internet
              Denial-of-Service Considerations", RFC 4732,
              DOI 10.17487/RFC4732, December 2006,
              <https://www.rfc-editor.org/info/rfc4732>.

   [RFC7556]  Anipko, D., Ed., "Multiple Provisioning Domain
              Architecture", RFC 7556, DOI 10.17487/RFC7556, June 2015,
              <https://www.rfc-editor.org/info/rfc7556>.






Boucadair & Reddy        Expires April 19, 2018                [Page 13]

Internet-Draft              DOTS Multihoming                October 2017


   [RFC8043]  Sarikaya, B. and M. Boucadair, "Source-Address-Dependent
              Routing and Source Address Selection for IPv6 Hosts:
              Overview of the Problem Space", RFC 8043,
              DOI 10.17487/RFC8043, January 2017,
              <https://www.rfc-editor.org/info/rfc8043>.

Authors' Addresses

   Mohamed Boucadair
   Orange
   Rennes  35000
   France

   Email: mohamed.boucadair@orange.com


   Tirumaleswar Reddy
   McAfee, Inc.
   Embassy Golf Link Business Park
   Bangalore, Karnataka  560071
   India

   Email: TirumaleswarReddy_Konda@McAfee.com




























Boucadair & Reddy        Expires April 19, 2018                [Page 14]
